app/Http/Controllers/Enderecos/BairroController.php

    public function index() {

        $bairros = Bairro::with('regiao')->orderBy('nome')->get();
---
select * from `bairros` order by `nome` asc