app/Http/Controllers/Enderecos/CidadeController.php

    public function index() {

        $cidades = Cidade::with('uf')->orderBy('nome')->get();
---
select * from `cidades` order by `nome` asc