app/Http/Controllers/Reserva/ReservaController.php

    public function index() {

        $paineis = Painel::with('bairro.regiao.cidade')
            ->orderByRaw("CAST(identificacao AS UNSIGNED) ASC")
            ->get();

        $anos = Ano::all();

        $reservas = DB::table('reservas AS res')
                        ->join('outdoors AS out', 'res.outdoor_id', '=', 'out.id')
        ->get();

        $bisemanas = Bisemana::all();

        $bairros = Bairro::orderBy('nome')->get();

        $regioes = Regiao::orderBy('nome')->get();

        $cidades = Cidade::orderBy('nome')->get();

        $ambiente = env('APP_ENV');

        $clientes = Cliente::orderBy('razao_social')
        ->where('ativo', 1)
        ->get();

        $whatsapp = Whatsapp::all();
---
select * from `outdoors` as `out` inner join `reservas` as `res` on `res`.`outdoor_id` = `out`.`id` where 1 = 1 group by `out`.`id` order by `out`.`identificacao` asc