app/Http/Controllers/Reserva/ReservaController.php

    public function index() {

        $paineis = Painel::with('bairro.regiao.cidade')->get();

        $anos = Ano::all();

        $reservas = DB::table('reservas AS res')
                        ->join('outdoors AS out', 'res.outdoor_id', '=', 'out.id')
        ->get();

        $bisemanas = Bisemana::all();

        $bairros = Bairro::orderBy('nome')->get();

        $regioes = Regiao::orderBy('nome')->get();

        $cidades = Cidade::orderBy('nome')->get();

        $ambiente = env('APP_ENV');

        $clientes = Cliente::orderBy('razao_social')->get();

        $whatsapp = Whatsapp::all();
---
select * from `bairros` where `bairros`.`id` in (2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 18, 19, 20, 21, 22, 23, 24, 25, 39)
select * from `cidades` where `cidades`.`id` in (3, 4, 5, 6, 7, 8, 9)
select * from `reservas` as `res` inner join `outdoors` as `out` on `res`.`outdoor_id` = `out`.`id`
select * from `outdoors` as `out`
select * from `bisemanas`
select * from `bairros` order by `nome` asc
select * from `cidades` order by `nome` asc

    public function getPaineis(Request $request) {
        $bairro = $request->bairro;
        $regiao = $request->regiao;
        $cidade = $request->cidade;

        $paineis = Painel::with('bairro.regiao.cidade')->get();
---
select * from `bairros` where `bairros`.`id` in (2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 18, 19, 20, 21, 22, 23, 24, 25)