app/Http/Controllers/Clientes/ClienteController.php

select * from `clientes` order by `nome_fantasia` asc
---
    public function index() {

        $clientes = Cliente::orderBy('nome_fantasia')->get();